#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.github_codeartifact will be created
  + resource "aws_iam_policy" "github_codeartifact" {
      + arn         = (known after apply)
      + description = "Permissions to access state bucket and dynamo table"
      + id          = (known after apply)
      + name        = "oidc_codeartifact_readonly"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codeartifact:ReadFromRepository",
                          + "codeartifact:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "StateBucket"
                    },
                  + {
                      + Action   = "sts:GetServiceBearerToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Get token for codeartifact"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Project" = "demo-github"
        }
    }

  # module.github_codeartifact.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:pglagerweij/AWS-demo-project:pull_request"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::613963413230:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "oidc_codeartifact_ro"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Role" = "role-codeartifact-with-oidc"
        }
      + tags_all              = {
          + "Project" = "demo-github"
          + "Role"    = "role-codeartifact-with-oidc"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_codeartifact.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "oidc_codeartifact_ro"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @pglagerweij, Action: `pull_request`, Workflow: `terraform-pipeline-pr`*